In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = pd.Index(np.arange(3))

In [3]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [6]:
a = [1,2,3,4]

In [7]:
del a[2]

In [4]:
labels.delete(1)

Int64Index([0, 2], dtype='int64')

In [8]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [18]:
labels = labels.insert(-1,199)

In [19]:
labels

Int64Index([0, 1, 199, 2], dtype='int64')

In [20]:
labels.is_monotonic_increasing

False

In [21]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [25]:
obj.reindex(['aa','bb','cc','a'])

aa    NaN
bb    NaN
cc    NaN
a    -5.3
dtype: float64

In [23]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [41]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])

In [31]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

- axis (1) means columns axis

In [33]:
data.drop('three',axis=1)

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

In [36]:
data.drop('Ohio',axis=0) #rows

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### drop multiple colums/rows in datafarme

In [42]:
data.drop(['Ohio','Utah'],axis=0) #rows

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

- With above code it will not change original dataframe. It will just use the original df and return a copy (chaged)
- if we use `inplace = True` it will not return us anything BUT will change the original df

In [43]:
data.drop(['Ohio','Utah'],axis=0, inplace=True) #rows #change orignal df

In [44]:
data

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [55]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

## obj[[True,False,True,False]]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [48]:
obj < 2

a     True
b     True
c    False
d    False
dtype: bool

In [51]:
obj[[True,False,True,False]]

a    0.0
c    2.0
dtype: float64

In [56]:
obj[   obj < 2     ]

a    0.0
b    1.0
dtype: float64

In [57]:
obj['b']

1.0

In [58]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [60]:
obj['a':'c'] = 55

In [61]:
obj

a    55.0
b    55.0
c    55.0
d     3.0
dtype: float64

In [67]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
cata_col_name_list = ['one','four']

In [66]:
data[cata_col_name_list]

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [68]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data['three']

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [71]:
a = data['three'] > 5
a

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [72]:
data[a]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [ ]:
data['two']

In [76]:
data [ data < 5 ] =111

In [77]:
data

          one  two  three  four
Ohio      111  111    111   111
Colorado  111    5      6     7
Utah        8    9     10    11
New York   12   13     14    15